step 1: import libraries

In [5]:
import pandas as pd
from datetime import datetime

step 2:Create student marks csv

In [8]:
data = [
    ["Muhammad Qasim", "Math", 85, "2024-01-10"],
    ["Muhammad Qasim", "English", 78, "2024-01-10"],
    ["Muhammad Qasim", "Science", 88, "2024-01-10"],
    
    ["Muhammad Qasim", "Math", 90, "2024-03-15"],
    ["Muhammad Qasim", "English", 82, "2024-03-15"],
    ["Muhammad Qasim", "Science", 91, "2024-03-15"]
]

columns = ["student_name", "subject", "marks", "exam_date"]

df = pd.DataFrame(data, columns=columns)
df.to_csv("student_marks.csv", index=False)

df

     student_name  subject  marks   exam_date
0  Muhammad Qasim     Math     85  2024-01-10
1  Muhammad Qasim  English     78  2024-01-10
2  Muhammad Qasim  Science     88  2024-01-10
3  Muhammad Qasim     Math     90  2024-03-15
4  Muhammad Qasim  English     82  2024-03-15
5  Muhammad Qasim  Science     91  2024-03-15

step 4:Function to calculate Grade

In [9]:
def calculate_grade(marks):
    if marks >= 90:
        return "A+"
    elif marks >= 80:
        return "A"
    elif marks >= 70:
        return "B"
    elif marks >= 60:
        return "C"
    else:
        return "Fail"

step5: Apply Grade Function

In [10]:
df["grade"] = df["marks"].apply(calculate_grade)
df

     student_name  subject  marks   exam_date grade
0  Muhammad Qasim     Math     85  2024-01-10     A
1  Muhammad Qasim  English     78  2024-01-10     B
2  Muhammad Qasim  Science     88  2024-01-10     A
3  Muhammad Qasim     Math     90  2024-03-15    A+
4  Muhammad Qasim  English     82  2024-03-15     A
5  Muhammad Qasim  Science     91  2024-03-15    A+

step6:separate Exam-1 and Exam-2

In [11]:
df["exam_date"] = pd.to_datetime(df["exam_date"])

exam1 = df[df["exam_date"] == df["exam_date"].min()]
exam2 = df[df["exam_date"] == df["exam_date"].max()]

step7: compare Exam result

In [12]:
comparison = exam1.merge(
    exam2,
    on="subject",
    suffixes=("_Exam1", "_Exam2")
)

comparison["marks_difference"] = comparison["marks_Exam2"] - comparison["marks_Exam1"]

comparison

,student_name_Exam1,subject,marks_Exam1,exam_date_Exam1,grade_Exam1,student_name_Exam2,marks_Exam2,exam_date_Exam2,grade_Exam2,marks_difference
0,Muhammad Qasim,Math,85,2024-01-10,A,Muhammad Qasim,90,2024-03-15,A+,5
1,Muhammad Qasim,English,78,2024-01-10,B,Muhammad Qasim,82,2024-03-15,A,4
2,Muhammad Qasim,Science,88,2024-01-10,A,Muhammad Qasim,91,2024-03-15,A+,3

step8:Final result Export

In [13]:
final_results = comparison[[
    "student_name_Exam1",
    "subject",
    "marks_Exam1",
    "marks_Exam2",
    "marks_difference"
]]

final_results.rename(columns={"student_name_Exam1": "student_name"}, inplace=True)

final_results.to_csv("final_results.csv", index=False)
final_results

C:\Users\MOHAIB\AppData\Local\Temp\ipykernel_14796\395952590.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_results.rename(columns={"student_name_Exam1": "student_name"}, inplace=True)

     student_name  subject  marks_Exam1  marks_Exam2  marks_difference
0  Muhammad Qasim     Math           85           90                 5
1  Muhammad Qasim  English           78           82                 4
2  Muhammad Qasim  Science           88           91                 3

step9:Subject summary

In [13]:
subject_summary = df.groupby("subject").agg(
    average_marks=("marks", "mean"),
    highest_marks=("marks", "max"),
    lowest_marks=("marks", "min")
).reset_index()

subject_summary.to_csv("subject_summary.csv", index=False)
subject_summary

NameError: name 'df' is not defined